OdRxMemberQueryEngine.Dispose
\details
Class destructor

OdRxMemberQueryEngine.removeReactor(OdRxMemberReactor*)
\details
Unregisters a reactor.
\param pReactor [in] Reactor to be removed.

OdRxMemberQueryEngine.addReactor(OdRxMemberReactor*)
\details
Registers a new reactor.
\param pReactor [in] Reactor to be registered.

OdRxMemberQueryEngine.removeFacetProvider(OdRxFacetProvider*)
\details
Unregisters an extension provider.
\param pProvider [in] Facet provider to be removed.

OdRxMemberQueryEngine.addFacetProvider(OdRxFacetProvider*)
\details
Registers a new facet provider (to provide extension classes with additional
members).
\param pProvider [in] Facet provider to be registered.

OdRxMemberQueryEngine.promotingContext
\details
Reference to the default promoting query context.
Handles collecting members in a list, but unlike the default, this one
includes children (sub-properties) in the list, instead of parents.
For example OdDbLine property "EndPoint" would be replaced by "EndPoint/X",
"EndPoint/Y", "EndPoint/Z" if queried using this context.
\returns
Promoting query context.

OdRxMemberQueryEngine.defaultContext
\details
Gets a reference to the default query context.
Query context handles collecting members in a list.
\returns
Query context.

OdRxMemberQueryEngine.newMemberIterator(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*)
\details
Enumerates all the properties of the object, uses defaultContext() if no
context is passed.
\param pO       [in] Object to enumerate the properties of.
\param pContext [in] Context. Optional.
\returns
Pointer to the iterator of the enumerated properties.

OdRxMemberQueryEngine.find(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.UInt16!System.Runtime.CompilerServices.IsConst*,OdRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Finds a member by name, uses defaultContext() if no context is passed.
\param pO           [in] Object to search the member in.
\param name         [in] Name of the member to be found.
\param pContext     [in] Context. Optional.
\param bQueryFacets [in] Flag determines if the function will query members
added dynamically by facet providers. Default value
is true.
\returns
Pointer to the found member.

OdRxMemberQueryEngine.theEngine
\details
This singleton object is the main access point to the member engine
services.
\returns
The member engine services access point object.